Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.surface.usage
source: Usage: cmux surface ls [<machine>|local] [--refresh] [--json] cmux surface open <resource> [--workspace <id|ref|index>] [--pane <id|ref>] [--left|--right|--up|--down|--tab] [--new] [--focus <true|false>] cmux surface new-terminal --machine <id|local> [--cwd <dir>] [--name <name>] [--remote-workspace <ws_…>] [--workspace <id|ref|index>] [--no-open] [-- <command...>] cmux surface resume set [flags] -- <argv...> cmux surface resume set [flags] --shell <command> cmux surface resume show [--json] [flags] cmux surface resume get [--json] [flags] cmux surface resume clear [flags] ls / open / new-terminal: the surface catalog. Terminals, VNC screens and browsers on This Mac and on every cloud machine are resources (`<machine>/<kind>/<key>`, e.g. local/terminal/<uuid>, vivid-newt/terminal/term_2f9c…, vivid-newt/display/display:1, vivid-newt/browser/port:3000); panes project them. `open` reuses the pane already showing a resource unless --new; --pane with a side splits that pane on that side, --tab adds a tab to it. A local terminal moves to the destination (it is shown once). `new-terminal` creates a terminal on the machine (cloud: in its cmux-tui session). `cmux vm tree` prints the same catalog. resume: attach restart command metadata to a terminal surface. Public CLI bindings are stored for inspection and manual restore. Flags: --workspace <id|ref|index> Workspace context (default: $CMUX_WORKSPACE_ID) --surface <id|ref|index> Surface context (default: $CMUX_SURFACE_ID) --window <id|ref|index> Window context for workspace and surface refs/indexes --cwd <path> Working directory for restore (default: $PWD) --name <name> Display name for the binding --kind <kind> Binding kind, for example agent or tmux --checkpoint <id> Provider checkpoint or session id --checkpoint-id <id> Same as --checkpoint and takes precedence --source <source> Binding source label Examples: cmux surface resume set --kind tmux --shell "tmux attach -t work" cmux surface resume set --kind opencode --checkpoint ses_123 -- opencode --session ses_123 cmux surface resume show --json
ar: الاستخدام: cmux surface ls [<machine>|local] [--refresh] [--json] cmux surface open <resource> [--workspace <id|ref|index>] [--pane <id|ref>] [--left|--right|--up|--down|--tab] [--new] [--focus <true|false>] cmux surface new-terminal --machine <id|local> [--cwd <dir>] [--name <name>] [--remote-workspace <ws_…>] [--workspace <id|ref|index>] [--no-open] [-- <command...>] cmux surface resume set [flags] -- <argv...> cmux surface resume set [flags] --shell <command> cmux surface resume show [--json] [flags] cmux surface resume get [--json] [flags] cmux surface resume clear [flags] ls / open / new-terminal: كتالوج الأسطح. الطرفيات، وشاشات VNC، والمتصفحات على This Mac وعلى كل جهاز سحابي هي موارد (`<machine>/<kind>/<key>`، على سبيل المثال local/terminal/<uuid>، أو vivid-newt/terminal/term_2f9c…، أو vivid-newt/display/display:1، vivid-newt/browser/port:3000)؛ الأجزاء تعرضهم. يعيد الأمر `open` استخدام الجزء الذي يعرض موردًا بالفعل ما لم يتم تمرير --new؛ وتمرير --pane مع تحديد جانب يقسم ذلك الجزء على ذلك الجانب، وتمرير --tab يضيف علامة تبويب إليه. تنتقل الطرفية المحلية إلى الوجهة (تُعرض مرة واحدة). ينشئ الأمر `new-terminal` طرفية على الجهاز (في السحابة: في جلسة cmux-tui الخاصة به). يطبع الأمر `cmux vm tree` الكتالوج نفسه. resume: إرفاق بيانات تعريف أمر إعادة التشغيل بسطح طرفية. تُخزن ارتباطات واجهة CLI العامة للفحص والاستعادة اليدوية. العلامات: --workspace <id|ref|index> سياق مساحة العمل (الافتراضي: $CMUX_WORKSPACE_ID) --surface <id|ref|index> سياق السطح (الافتراضي: $CMUX_SURFACE_ID) --window <id|ref|index> سياق النافذة لمراجع/فهارس مساحة العمل والسطح --cwd <path> مجلد العمل للاستعادة (الافتراضي: $PWD) --name <name> الاسم المعروض للارتباط --kind <kind> نوع الارتباط، على سبيل المثال agent أو tmux --checkpoint <id> نقطة تفتيش الموفر أو معرف الجلسة --checkpoint-id <id> مطابق لـ --checkpoint وله الأولوية --source <source> ملصق مصدر الارتباط أمثلة: cmux surface resume set --kind tmux --shell "tmux attach -t work" cmux surface resume set --kind opencode --checkpoint ses_123 -- opencode --session ses_123 cmux surface resume show --json
de: Verwendung: cmux surface ls [<Maschine>|local] [--refresh] [--json] cmux surface open <Ressource> [--workspace <ID|Ref|Index>] [--pane <ID|Ref>] [--left|--right|--up|--down|--tab] [--new] [--focus <true|false>] cmux surface new-terminal --machine <ID|local> [--cwd <Verzeichnis>] [--name <Name>] [--remote-workspace <ws_…>] [--workspace <ID|Ref|Index>] [--no-open] [-- <Befehl...>] cmux surface resume set [Flags] -- <Argv...> cmux surface resume set [Flags] --shell <Befehl> cmux surface resume show [--json] [Flags] cmux surface resume get [--json] [Flags] cmux surface resume clear [Flags] ls / open / new-terminal: Der Oberflächenkatalog. Terminals, VNC-Bildschirme und Browser auf diesem Mac und auf jeder Cloud-Maschine sind Ressourcen (`<Maschine>/<Art>/<Schlüssel>`, z. B. local/terminal/<UUID>, vivid-newt/terminal/term_2f9c…, vivid-newt/display/display:1, vivid-newt/browser/port:3000); Teilfenster projizieren sie. `open` verwendet das Teilfenster, das bereits eine Ressource anzeigt, wieder, es sei denn, --new wird verwendet; --pane mit einer Richtungsangabe teilt dieses Teilfenster auf dieser Seite auf, --tab fügt ihm einen Tab hinzu. Ein lokales Terminal verschiebt sich an das Ziel (es wird einmal angezeigt). `new-terminal` erstellt ein Terminal auf der Maschine (Cloud: in ihrer cmux-tui-Sitzung). `cmux vm tree` gibt denselben Katalog aus. resume: Startbefehl-Metadaten an eine Terminal-Oberfläche anhängen. Öffentliche CLI-Bindungen werden zur Überprüfung und manuellen Wiederherstellung gespeichert. Flags: --workspace <ID|Ref|Index> Kontext des Arbeitsbereichs (Standard: $CMUX_WORKSPACE_ID) --surface <ID|Ref|Index> Kontext der Oberfläche (Standard: $CMUX_SURFACE_ID) --window <ID|Ref|Index> Fensterkontext für Arbeitsbereichs- und Oberflächen-Referenzen/-Indizes --cwd <Pfad> Arbeitsverzeichnis für die Wiederherstellung (Standard: $PWD) --name <Name> Anzeigename für die Bindung --kind <Art> Art der Bindung, zum Beispiel agent oder tmux --checkpoint <ID> Anbieter-Prüfpunkt oder Sitzungs-ID --checkpoint-id <ID> Gleich wie --checkpoint und hat Vorrang --source <Quelle> Quelle der Bindung (Label) Beispiele: cmux surface resume set --kind tmux --shell "tmux attach -t work" cmux surface resume set --kind opencode --checkpoint ses_123 -- opencode --session ses_123 cmux surface resume show --json
es: Uso: cmux surface ls [<machine>|local] [--refresh] [--json] cmux surface open <resource> [--workspace <id|ref|index>] [--pane <id|ref>] [--left|--right|--up|--down|--tab] [--new] [--focus <true|false>] cmux surface new-terminal --machine <id|local> [--cwd <dir>] [--name <name>] [--remote-workspace <ws_…>] [--workspace <id|ref|index>] [--no-open] [-- <command...>] cmux surface resume set [flags] -- <argv...> cmux surface resume set [flags] --shell <command> cmux surface resume show [--json] [flags] cmux surface resume get [--json] [flags] cmux surface resume clear [flags] ls / open / new-terminal: el catálogo de superficies. Terminales, pantallas VNC y navegadores en Este Mac y en cada máquina en la nube son recursos (`<machine>/<kind>/<key>`, por ejemplo, local/terminal/<uuid>, vivid-newt/terminal/term_2f9c…, vivid-newt/display/display:1, vivid-newt/browser/port:3000); los paneles los proyectan. `open` reutiliza el panel que ya muestra un recurso a menos que se use --new; --pane con un lado divide ese panel en ese lado, --tab le añade una pestaña. Una terminal local se mueve al destino (se muestra una sola vez). `new-terminal` crea una terminal en la máquina (nube: en su sesión cmux-tui). `cmux vm tree` muestra el mismo catálogo. resume: asocia metadatos de comandos de reinicio a una superficie de terminal. Las vinculaciones públicas de la CLI se guardan para su inspección y restauración manual. Opciones: --workspace <id|ref|index> Contexto del espacio de trabajo (predeterminado: $CMUX_WORKSPACE_ID) --surface <id|ref|index> Contexto de la superficie (predeterminado: $CMUX_SURFACE_ID) --window <id|ref|index> Contexto de la ventana para referencias/índices de espacios de trabajo y superficies --cwd <path> Directorio de trabajo para restaurar (predeterminado: $PWD) --name <name> Nombre para mostrar de la vinculación --kind <kind> Tipo de vinculación, por ejemplo agent o tmux --checkpoint <id> Punto de control del proveedor o id de sesión --checkpoint-id <id> Igual que --checkpoint y tiene precedencia --source <source> Etiqueta de origen de la vinculación Ejemplos: cmux surface resume set --kind tmux --shell "tmux attach -t work" cmux surface resume set --kind opencode --checkpoint ses_123 -- opencode --session ses_123 cmux surface resume show --json
fr: Usage: cmux surface ls [<machine>|local] [--refresh] [--json] cmux surface open <resource> [--workspace <id|ref|index>] [--pane <id|ref>] [--left|--right|--up|--down|--tab] [--new] [--focus <true|false>] cmux surface new-terminal --machine <id|local> [--cwd <dir>] [--name <name>] [--remote-workspace <ws_…>] [--workspace <id|ref|index>] [--no-open] [-- <command...>] cmux surface resume set [flags] -- <argv...> cmux surface resume set [flags] --shell <command> cmux surface resume show [--json] [flags] cmux surface resume get [--json] [flags] cmux surface resume clear [flags] ls / open / new-terminal : le catalogue des surfaces d’affichage. Les terminaux, écrans VNC et navigateurs sur Ce Mac et sur chaque machine cloud sont des ressources (`<machine>/<kind>/<key>`, par ex. local/terminal/<uuid>, vivid-newt/terminal/term_2f9c…, vivid-newt/display/display:1, vivid-newt/browser/port:3000) ; les volets les projettent. `open` réutilise le volet affichant déjà une ressource sauf si --new ; --pane avec un côté divise ce volet de ce côté, --tab lui ajoute un onglet. Un terminal local se déplace vers la destination (il n’est affiché qu’une seule fois). `new-terminal` crée un terminal sur la machine (cloud : dans sa session cmux-tui). `cmux vm tree` affiche le même catalogue. resume : associe des métadonnées de commande de redémarrage à une surface d’affichage de terminal. Les liaisons CLI publiques sont stockées pour inspection et restauration manuelle. Flags : --workspace <id|ref|index> Contexte de l'espace de travail (par défaut : $CMUX_WORKSPACE_ID) --surface <id|ref|index> Contexte de la surface d'affichage (par défaut : $CMUX_SURFACE_ID) --window <id|ref|index> Contexte de la fenêtre pour les réf/index d'espace de travail et de surface d'affichage --cwd <path> Répertoire de travail pour la restauration (par défaut : $PWD) --name <name> Nom d'affichage pour la liaison --kind <kind> Type de liaison, par exemple agent ou tmux --checkpoint <id> Point de contrôle du fournisseur ou ID de session --checkpoint-id <id> Identique à --checkpoint et a la priorité --source <source> Étiquette de la source de liaison Exemples : cmux surface resume set --kind tmux --shell "tmux attach -t work" cmux surface resume set --kind opencode --checkpoint ses_123 -- opencode --session ses_123 cmux surface resume show --json
ja: 使用法: cmux surface ls [<machine>|local] [--refresh] [--json] cmux surface open <resource> [--workspace <id|ref|index>] [--pane <id|ref>] [--left|--right|--up|--down|--tab] [--new] [--focus <true|false>] cmux surface new-terminal --machine <id|local> [--cwd <dir>] [--name <name>] [--remote-workspace <ws_…>] [--workspace <id|ref|index>] [--no-open] [-- <command...>] cmux surface resume set [flags] -- <argv...> cmux surface resume set [flags] --shell <command> cmux surface resume show [--json] [flags] cmux surface resume get [--json] [flags] cmux surface resume clear [flags] ls / open / new-terminal: サーフェスカタログを操作します。この Mac と各クラウドマシンの ターミナル、VNC 画面、ブラウザはリソースです（`<machine>/<kind>/<key>`。例: local/terminal/<uuid>、vivid-newt/terminal/term_2f9c…、vivid-newt/display/display:1、 vivid-newt/browser/port:3000）。ペインはこれらを表示します。`open` は --new を指定しない限り 同じリソースを表示中のペインを再利用します。--pane と方向を指定するとその方向に分割し、 --tab はタブを追加します。ローカルターミナルは移動先へ移され、同時に 1 か所だけで表示されます。 `new-terminal` はマシン上にターミナルを作成します（クラウドでは cmux-tui セッション内）。 `cmux vm tree` も同じカタログを表示します。 resume: ターミナルサーフェスに再起動コマンドのメタデータを関連付けます。 公開 CLI バインディングは確認と手動復元のために保存されます。 フラグ: --workspace <id|ref|index> ワークスペースのコンテキスト（既定: $CMUX_WORKSPACE_ID） --surface <id|ref|index> サーフェスのコンテキスト（既定: $CMUX_SURFACE_ID） --window <id|ref|index> ワークスペースとサーフェスの参照・番号に使うウィンドウ --cwd <path> 復元時の作業ディレクトリ（既定: $PWD） --name <name> バインディングの表示名 --kind <kind> バインディング種別（例: agent、tmux） --checkpoint <id> プロバイダのチェックポイントまたはセッション ID --checkpoint-id <id> --checkpoint と同じ（こちらを優先） --source <source> バインディングのソースラベル 例: cmux surface resume set --kind tmux --shell "tmux attach -t work" cmux surface resume set --kind opencode --checkpoint ses_123 -- opencode --session ses_123 cmux surface resume show --json
ko: 사용법: cmux surface ls [<machine>|local] [--refresh] [--json] cmux surface open <resource> [--workspace <id|ref|index>] [--pane <id|ref>] [--left|--right|--up|--down|--tab] [--new] [--focus <true|false>] cmux surface new-terminal --machine <id|local> [--cwd <dir>] [--name <name>] [--remote-workspace <ws_…>] [--workspace <id|ref|index>] [--no-open] [-- <command...>] cmux surface resume set [flags] -- <argv...> cmux surface resume set [flags] --shell <command> cmux surface resume show [--json] [flags] cmux surface resume get [--json] [flags] cmux surface resume clear [flags] ls / open / new-terminal: 화면 카탈로그. 이 Mac 및 모든 클라우드 머신의 터미널, VNC 화면 및 브라우저는 리소스(`<machine>/<kind>/<key>`, 예: local/terminal/<uuid>, vivid-newt/terminal/term_2f9c…, vivid-newt/display/display:1, vivid-newt/browser/port:3000)이며, 분할 창이 이를 보여줍니다. `open`은 --new가 없는 한 리소스를 이미 보여주고 있는 분할 창을 재사용합니다. 방향이 지정된 --pane은 해당 방향으로 해당 분할 창을 분할하고, --tab은 여기에 탭을 추가합니다. 로컬 터미널은 대상 위치로 이동합니다 (한 번만 표시됨). `new-terminal`은 머신에 터미널을 생성합니다 (클라우드: cmux-tui 세션 내부). `cmux vm tree`도 동일한 카탈로그를 출력합니다. resume: 터미널 화면에 재시작 명령 메타데이터를 추가합니다. 공공 CLI 바인딩은 검사 및 수동 복구를 위해 저장됩니다. 플래그: --workspace <id|ref|index> 작업 공간 컨텍스트 (기본값: $CMUX_WORKSPACE_ID) --surface <id|ref|index> 화면 컨텍스트 (기본값: $CMUX_SURFACE_ID) --window <id|ref|index> 작업 공간 및 화면 참조/인덱스를 위한 창 컨텍스트 --cwd <path> 복구용 작업 디렉토리 (기본값: $PWD) --name <name> 바인딩에 표시할 이름 --kind <kind> 바인딩 종류 (예: agent 또는 tmux) --checkpoint <id> 제공자 체크포인트 또는 세션 ID --checkpoint-id <id> --checkpoint와 동일하며 우선 적용됩니다 --source <source> 바인딩 소스 레이블 예시: cmux surface resume set --kind tmux --shell "tmux attach -t work" cmux surface resume set --kind opencode --checkpoint ses_123 -- opencode --session ses_123 cmux surface resume show --json
zh_hans: 用法：cmux surface ls [<machine>|local] [--refresh] [--json] cmux surface open <resource> [--workspace <id|ref|index>] [--pane <id|ref>] [--left|--right|--up|--down|--tab] [--new] [--focus <true|false>] cmux surface new-terminal --machine <id|local> [--cwd <dir>] [--name <name>] [--remote-workspace <ws_…>] [--workspace <id|ref|index>] [--no-open] [-- <command...>] cmux surface resume set [flags] -- <argv...> cmux surface resume set [flags] --shell <command> cmux surface resume show [--json] [flags] cmux surface resume get [--json] [flags] cmux surface resume clear [flags] ls / open / new-terminal：表面目录。本机与每台云端机器上的终端、VNC 屏幕和浏览器 都是资源（`<machine>/<kind>/<key>`，例如 local/terminal/<uuid>、 vivid-newt/terminal/term_2f9c…、vivid-newt/display/display:1、 vivid-newt/browser/port:3000）；窗格是它们的投影。除非加 --new，`open` 会复用 已显示该资源的窗格；--pane 配合方向会把该窗格朝那一侧拆分，--tab 则给它加一个标签页。 本机终端会移动到目标位置（它同时只显示一处）。 `new-terminal` 会在该机器上创建终端（云端：在其 cmux-tui 会话中）。 `cmux vm tree` 打印同一份目录。 resume：为终端表面附加重启命令元数据。 公开的 CLI 绑定会被存储，供查看和手动恢复。 标志: --workspace <id|ref|index> 工作区上下文（默认：$CMUX_WORKSPACE_ID） --surface <id|ref|index> 表面上下文（默认：$CMUX_SURFACE_ID） --window <id|ref|index> 工作区与表面引用/索引的窗口上下文 --cwd <path> 恢复时使用的工作目录（默认：$PWD） --name <name> 该绑定的显示名称 --kind <kind> 绑定类型，例如 agent 或 tmux --checkpoint <id> 提供方的检查点或会话 id --checkpoint-id <id> 与 --checkpoint 相同，且优先级更高 --source <source> 绑定来源标签 示例: cmux surface resume set --kind tmux --shell "tmux attach -t work" cmux surface resume set --kind opencode --checkpoint ses_123 -- opencode --session ses_123 cmux surface resume show --json
zh_hant: 用法：cmux surface ls [<machine>|local] [--refresh] [--json] cmux surface open <resource> [--workspace <id|ref|index>] [--pane <id|ref>] [--left|--right|--up|--down|--tab] [--new] [--focus <true|false>] cmux surface new-terminal --machine <id|local> [--cwd <dir>] [--name <name>] [--remote-workspace <ws_…>] [--workspace <id|ref|index>] [--no-open] [-- <command...>] cmux surface resume set [flags] -- <argv...> cmux surface resume set [flags] --shell <command> cmux surface resume show [--json] [flags] cmux surface resume get [--json] [flags] cmux surface resume clear [flags] ls / open / new-terminal：介面目錄。這部 Mac 及所有雲端機器上的 終端機、VNC 螢幕和瀏覽器皆為資源 (`<machine>/<kind>/<key>`， 例如：local/terminal/<uuid>、vivid-newt/terminal/term_2f9c…、vivid-newt/display/display:1、 vivid-newt/browser/port:3000)；窗格會對它們進行投影。`open` 會重複使用已經 顯示該資源的窗格 (除非指定 --new)；附帶側邊方向的 --pane 會在該側分割該窗格， --tab 則會對其新增一個標籤頁。本機終端機會移動到目的地 (它只會顯示一次)。 `new-terminal` 會在機器上建立一個終端機 (雲端：在其 cmux-tui 工作階段中)。 `cmux vm tree` 會列印相同的目錄。 resume：將重新啟動命令的中繼資料附加至終端機介面。 公開的 CLI 綁定會儲存以供檢視和手動還原。 旗標： --workspace <id|ref|index> 工作區上下文 (預設值：$CMUX_WORKSPACE_ID) --surface <id|ref|index> 介面上下文 (預設值：$CMUX_SURFACE_ID) --window <id|ref|index> 工作區與介面引用/索引的視窗上下文 --cwd <path> 用於還原的工作目錄 (預設值：$PWD) --name <name> 綁定的顯示名稱 --kind <kind> 綁定種類，例如 agent 或 tmux --checkpoint <id> 提供者檢查點或工作階段識別碼 --checkpoint-id <id> 與 --checkpoint 相同且優先適用 --source <source> 綁定來源標籤 範例： cmux surface resume set --kind tmux --shell "tmux attach -t work" cmux surface resume set --kind opencode --checkpoint ses_123 -- opencode --session ses_123 cmux surface resume show --json

# cli.surfaceResume.set.error.unknownFlag
source: surface resume set: unknown flag '%1$@'. Known flags: %2$@. Use -- <argv...> for command arguments.
ar: surface resume set: علامة غير معروفة '%1$@'. العلامات المعروفة: %2$@. استخدم -- <argv...> لوسيطات الأمر.
de: surface resume set: unbekanntes Flag „%1$@“. Bekannte Flags: %2$@. Verwenden Sie -- <argv...> für Befehlsargumente.
es: surface resume set: opción desconocida '%1$@'. Opciones conocidas: %2$@. Usa -- <argv...> para argumentos de comando.
fr: surface resume set : option inconnue '%1$@'. Options connues : %2$@. Utilisez -- <argv...> pour les arguments de commande.
ja: surface resume set: 不明なフラグ '%1$@'。利用可能なフラグ: %2$@。コマンド引数には -- <argv...> を使用してください。
ko: surface resume set: 알 수 없는 플래그 '%1$@'. 알려진 플래그: %2$@. 명령어 인수에는 -- <argv...>를 사용하세요.
zh_hans: surface resume set: 未知标志 '%1$@'。已知标志：%2$@。命令参数请用 -- <argv...> 传入。
zh_hant: surface resume set：未知的旗標 '%1$@'。已知的旗標：%2$@。使用 -- <argv...> 以提供命令引數。

# cli.tmux-compat.error.downstreamTmuxMissing
source: cmux tmux shim: no downstream tmux executable found
ar: cmux tmux shim: لم يتم العثور على ملف tmux تنفيذي لاحق
de: cmux tmux-Shim: Keine nachgelagerte ausführbare tmux-Datei gefunden
es: cmux tmux shim: no se encontró ningún ejecutable downstream de tmux
fr: cmux tmux shim : aucun exécutable tmux sous-jacent trouvé
ja: cmux tmux シム: 後続の tmux 実行ファイルが見つかりません
ko: cmux tmux shim: 하위 tmux 실행 파일을 찾을 수 없습니다
zh_hans: cmux tmux shim：未找到下游 tmux 可执行文件
zh_hant: cmux tmux 填充程式：找不到下游 tmux 可 executable 檔

# cli.tmux-compat.error.managedTerminalRequired
source: %@ must be launched from a cmux-managed terminal surface. Open a terminal surface in cmux and run this command there.
ar: يجب تشغيل %@ من سطح طرفية مدار بواسطة cmux. افتح سطح طرفية في cmux وتشغيل هذا الأمر هناك.
de: %@ muss von einer von cmux verwalteten Terminal-Oberfläche gestartet werden. Öffnen Sie eine Terminal-Oberfläche in cmux und führen Sie diesen Befehl dort aus.
es: %@ debe iniciarse desde una superficie de terminal administrada por cmux. Abre una superficie de terminal en cmux y ejecuta este comando allí.
fr: %@ doit être lancé depuis une surface d'affichage de terminal gérée par cmux. Ouvrez une surface d'affichage de terminal dans cmux et exécutez-y cette commande.
ja: %@ は cmux が管理するターミナルサーフェスから起動する必要があります。cmux でターミナルサーフェスを開き、そこでこのコマンドを実行してください。
ko: %@은(는) cmux가 관리하는 터미널 화면에서 실행해야 합니다. cmux에서 터미널 화면을 열고 거기서 이 명령어를 실행하세요.
zh_hans: %@ 必须从 cmux 管理的终端表面启动。请在 cmux 中打开一个终端表面，并在其中运行此命令。
zh_hant: %@ 必須從 cmux 管理的終端機介面啟動。在 cmux 中開啟一個終端機介面，並在該處執行此命令。

# cli.tmuxCompat.respawnPane.requiresForce
source: respawn-pane requires -k in cmux tmux compatibility mode
ar: يتطلب respawn-pane الخيار -k في وضع توافق cmux tmux
de: respawn-pane erfordert -k im cmux-tmux-Kompatibilitätsmodus
es: respawn-pane requiere -k en el modo de compatibilidad de tmux de cmux
fr: respawn-pane requiert -k en mode de compatibilité cmux tmux
ja: cmux の tmux 互換モードでは respawn-pane に -k が必要です
ko: cmux tmux 호환 모드에서 respawn-pane을(를) 실행하려면 -k가 필요합니다.
zh_hans: 在 cmux tmux 兼容模式下，respawn-pane 需要 -k
zh_hant: 在 cmux tmux 相容模式中，respawn-pane 需要 -k
